---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSystem.PanelName
source: html/e531a631-da7b-4ed6-cf28-7f1462800d0b.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSystem.PanelName Property

The Panel name of the Electrical System.

## Syntax (C#)
```csharp
public string PanelName { get; }
```

## Remarks
This property is used to retrieve the Panel name of the Electrical System.